[Killed] BlockStatement
sample_subject/src/mutants.ts:4:50
 export type Grade = "fail" | "pass" | "excellent";
 
 /** Boundary-sensitive grading — kills boundary mutants when fully tested. */
-export function gradeScore(score: number): Grade {
-  if (score < 50) {
-    return "fail";
-  }
-  if (score < 75) {
-    return "pass";
-  }
-  return "excellent";
-}
+export function gradeScore(score: number): Grade {}
 
 /** Strict comparisons — kills EqualityOperator / RelationalOperator mutants. */
killedBy: mutants — mutation-testing subject gradeScore kills boundary mutants at 50 and 75
statusReason: expected undefined to be 'fail' // Object.is equality

[Killed] EqualityOperator
sample_subject/src/mutants.ts:5:7
 
 /** Boundary-sensitive grading — kills boundary mutants when fully tested. */
 export function gradeScore(score: number): Grade {
-  if (score < 50) {
+  if (score <= 50) {
     return "fail";
   }
killedBy: mutants — mutation-testing subject gradeScore kills boundary mutants at 50 and 75
statusReason: expected 'fail' to be 'pass' // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:5:19
 
 /** Boundary-sensitive grading — kills boundary mutants when fully tested. */
 export function gradeScore(score: number): Grade {
-  if (score < 50) {
-    return "fail";
-  }
+  if (score < 50) {}
   if (score < 75) {
     return "pass";
killedBy: mutants — mutation-testing subject gradeScore kills boundary mutants at 50 and 75
statusReason: expected 'pass' to be 'fail' // Object.is equality

[Killed] StringLiteral
sample_subject/src/mutants.ts:6:12
 /** Boundary-sensitive grading — kills boundary mutants when fully tested. */
 export function gradeScore(score: number): Grade {
   if (score < 50) {
-    return "fail";
+    return "";
   }
   if (score < 75) {
killedBy: mutants — mutation-testing subject gradeScore kills boundary mutants at 50 and 75
statusReason: expected '' to be 'fail' // Object.is equality

[Killed] ConditionalExpression
sample_subject/src/mutants.ts:8:7
   if (score < 50) {
     return "fail";
   }
-  if (score < 75) {
+  if (true) {
     return "pass";
   }
killedBy: mutants — mutation-testing subject gradeScore kills boundary mutants at 50 and 75
statusReason: expected 'pass' to be 'excellent' // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:8:19
   if (score < 50) {
     return "fail";
   }
-  if (score < 75) {
-    return "pass";
-  }
+  if (score < 75) {}
   return "excellent";
 }
killedBy: mutants — mutation-testing subject gradeScore kills boundary mutants at 50 and 75
statusReason: expected 'excellent' to be 'pass' // Object.is equality

[Killed] StringLiteral
sample_subject/src/mutants.ts:9:12
     return "fail";
   }
   if (score < 75) {
-    return "pass";
+    return "";
   }
   return "excellent";
killedBy: mutants — mutation-testing subject gradeScore kills boundary mutants at 50 and 75
statusReason: expected '' to be 'pass' // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:15:76
 }
 
 /** Strict comparisons — kills EqualityOperator / RelationalOperator mutants. */
-export function isStrictlyBelow(value: number, threshold: number): boolean {
-  return value < threshold;
-}
+export function isStrictlyBelow(value: number, threshold: number): boolean {}
 
 export function isStrictlyAbove(value: number, threshold: number): boolean {
killedBy: mutants — mutation-testing subject isStrictlyBelow kills <= boundary mutants
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
sample_subject/src/mutants.ts:16:10
 
 /** Strict comparisons — kills EqualityOperator / RelationalOperator mutants. */
 export function isStrictlyBelow(value: number, threshold: number): boolean {
-  return value < threshold;
+  return value >= threshold;
 }
 
killedBy: mutants — mutation-testing subject isStrictlyBelow kills <= boundary mutants
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
sample_subject/src/mutants.ts:16:10
 
 /** Strict comparisons — kills EqualityOperator / RelationalOperator mutants. */
 export function isStrictlyBelow(value: number, threshold: number): boolean {
-  return value < threshold;
+  return value <= threshold;
 }
 
killedBy: mutants — mutation-testing subject isStrictlyBelow kills <= boundary mutants
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:19:76
   return value < threshold;
 }
 
-export function isStrictlyAbove(value: number, threshold: number): boolean {
-  return value > threshold;
-}
+export function isStrictlyAbove(value: number, threshold: number): boolean {}
 
 export function inRange(value: number, min: number, max: number): boolean {
killedBy: mutants — mutation-testing subject isStrictlyAbove kills >= boundary mutants
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
sample_subject/src/mutants.ts:20:10
 }
 
 export function isStrictlyAbove(value: number, threshold: number): boolean {
-  return value > threshold;
+  return value >= threshold;
 }
 
killedBy: mutants — mutation-testing subject isStrictlyAbove kills >= boundary mutants
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
sample_subject/src/mutants.ts:20:10
 }
 
 export function isStrictlyAbove(value: number, threshold: number): boolean {
-  return value > threshold;
+  return value <= threshold;
 }
 
killedBy: mutants — mutation-testing subject isStrictlyAbove kills >= boundary mutants
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:23:75
   return value > threshold;
 }
 
-export function inRange(value: number, min: number, max: number): boolean {
-  return value >= min && value <= max;
-}
+export function inRange(value: number, min: number, max: number): boolean {}
 
 export function classifySign(n: number): "negative" | "zero" | "positive" {
killedBy: mutants — mutation-testing subject inRange kills comparator mutants
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
sample_subject/src/mutants.ts:24:26
 }
 
 export function inRange(value: number, min: number, max: number): boolean {
-  return value >= min && value <= max;
+  return value >= min && value > max;
 }
 
killedBy: mutants — mutation-testing subject inRange kills comparator mutants
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
sample_subject/src/mutants.ts:24:10
 }
 
 export function inRange(value: number, min: number, max: number): boolean {
-  return value >= min && value <= max;
+  return value > min && value <= max;
 }
 
killedBy: mutants — mutation-testing subject inRange kills comparator mutants
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:27:75
   return value >= min && value <= max;
 }
 
-export function classifySign(n: number): "negative" | "zero" | "positive" {
-  if (n < 0) {
-    return "negative";
-  }
-  if (n === 0) {
-    return "zero";
-  }
-  return "positive";
-}
+export function classifySign(n: number): "negative" | "zero" | "positive" {}
 
 /** On equal inputs prefer the first operand — kills >= vs > mutant. */
killedBy: mutants — mutation-testing subject classifySign kills sign comparison mutants
statusReason: expected undefined to be 'negative' // Object.is equality

[Killed] EqualityOperator
sample_subject/src/mutants.ts:28:7
 }
 
 export function classifySign(n: number): "negative" | "zero" | "positive" {
-  if (n < 0) {
+  if (n >= 0) {
     return "negative";
   }
killedBy: mutants — mutation-testing subject classifySign kills sign comparison mutants
statusReason: expected 'positive' to be 'negative' // Object.is equality

[Killed] ConditionalExpression
sample_subject/src/mutants.ts:28:7
 }
 
 export function classifySign(n: number): "negative" | "zero" | "positive" {
-  if (n < 0) {
+  if (false) {
     return "negative";
   }
killedBy: mutants — mutation-testing subject classifySign kills sign comparison mutants
statusReason: expected 'positive' to be 'negative' // Object.is equality

[Killed] ConditionalExpression
sample_subject/src/mutants.ts:31:7
   if (n < 0) {
     return "negative";
   }
-  if (n === 0) {
+  if (false) {
     return "zero";
   }
killedBy: mutants — mutation-testing subject classifySign kills sign comparison mutants
statusReason: expected 'positive' to be 'zero' // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:31:16
   if (n < 0) {
     return "negative";
   }
-  if (n === 0) {
-    return "zero";
-  }
+  if (n === 0) {}
   return "positive";
 }
killedBy: mutants — mutation-testing subject classifySign kills sign comparison mutants
statusReason: expected 'positive' to be 'zero' // Object.is equality

[Killed] StringLiteral
sample_subject/src/mutants.ts:34:10
   if (n === 0) {
     return "zero";
   }
-  return "positive";
+  return "";
 }
 
killedBy: mutants — mutation-testing subject classifySign kills sign comparison mutants
statusReason: expected '' to be 'positive' // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:38:75
 }
 
 /** On equal inputs prefer the first operand — kills >= vs > mutant. */
-export function pickLargerWithTieBreaker(a: number, b: number): "a" | "b" {
-  if (a >= b) {
-    return "a";
-  }
-  return "b";
-}
+export function pickLargerWithTieBreaker(a: number, b: number): "a" | "b" {}
 
 export function clamp(value: number, min: number, max: number): number {
killedBy: mutants — mutation-testing subject pickLargerWithTieBreaker kills >= vs > mutant on ties
statusReason: expected undefined to be 'b' // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:39:15
 
 /** On equal inputs prefer the first operand — kills >= vs > mutant. */
 export function pickLargerWithTieBreaker(a: number, b: number): "a" | "b" {
-  if (a >= b) {
-    return "a";
-  }
+  if (a >= b) {}
   return "b";
 }
killedBy: mutants — mutation-testing subject pickLargerWithTieBreaker kills >= vs > mutant on ties
statusReason: expected 'b' to be 'a' // Object.is equality

[Killed] EqualityOperator
sample_subject/src/mutants.ts:39:7
 
 /** On equal inputs prefer the first operand — kills >= vs > mutant. */
 export function pickLargerWithTieBreaker(a: number, b: number): "a" | "b" {
-  if (a >= b) {
+  if (a > b) {
     return "a";
   }
killedBy: mutants — mutation-testing subject pickLargerWithTieBreaker kills >= vs > mutant on ties
statusReason: expected 'b' to be 'a' // Object.is equality

[Killed] BlockStatement
sample_subject/src/mutants.ts:45:72
   return "b";
 }
 
-export function clamp(value: number, min: number, max: number): number {
-  if (isStrictlyBelow(value, min)) {
-    return min;
-  }
-  if (isStrictlyAbove(value, max)) {
-    return max;
-  }
-  return value;
-}
+export function clamp(value: number, min: number, max: number): number {}
 
killedBy: mutants — mutation-testing subject clamp kills min/max branch mutants via strict helpers
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
sample_subject/src/mutants.ts:46:7
 }
 
 export function clamp(value: number, min: number, max: number): number {
-  if (isStrictlyBelow(value, min)) {
+  if (true) {
     return min;
   }
killedBy: mutants — mutation-testing subject clamp kills min/max branch mutants via strict helpers
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ConditionalExpression
sample_subject/src/mutants.ts:46:7
 }
 
 export function clamp(value: number, min: number, max: number): number {
-  if (isStrictlyBelow(value, min)) {
+  if (false) {
     return min;
   }
killedBy: mutants — mutation-testing subject clamp kills min/max branch mutants via strict helpers
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
sample_subject/src/mutants.ts:49:7
   if (isStrictlyBelow(value, min)) {
     return min;
   }
-  if (isStrictlyAbove(value, max)) {
+  if (true) {
     return max;
   }
killedBy: mutants — mutation-testing subject clamp kills min/max branch mutants via strict helpers
statusReason: expected 10 to be 5 // Object.is equality

[Killed] ConditionalExpression
sample_subject/src/mutants.ts:49:7
   if (isStrictlyBelow(value, min)) {
     return min;
   }
-  if (isStrictlyAbove(value, max)) {
+  if (false) {
     return max;
   }
killedBy: mutants — mutation-testing subject clamp kills min/max branch mutants via strict helpers
statusReason: expected 99 to be 10 // Object.is equality
